InformationRegisters/ПриоритетыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<InformationRegister>
		<Properties>
			<Name>ПриоритетыСкладов</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПриоритетыСкладов/Ext/ManagerModule.bsl
Функция ПолучитьВыборку(ДатаАктуальности) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриоритетыСкладовСрезПоследних.Приоритет КАК Приоритет,
	|	ПриоритетыСкладовСрезПоследних.Склад
	|ИЗ
	|	РегистрСведений.ПриоритетыСкладов.СрезПоследних(&ДатаАктуальности, ) КАК ПриоритетыСкладовСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	
	ВыборкаСкладов = Запрос.Выполнить().Выбрать();
	
	Возврат ВыборкаСкладов;
	
КонецФункции
